layer {
  name: "ExpandDims"
  type: "Input"
  top: "ExpandDims"
  input_param {
    shape {
      dim: 1
      dim: 299
      dim: 299
      dim: 3
    }
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D_perm0"
  type: "Permute"
  bottom: "ExpandDims"
  top: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Conv2D"
  top: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Conv2d_1a_3x3/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_1a_3x3/Relu"
  top: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Conv2D"
  top: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Conv2d_2a_3x3/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_2a_3x3/Relu"
  top: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Conv2D"
  top: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Conv2d_2b_3x3/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_2b_3x3/Relu"
  top: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool_nchw"
  type: "Pooling"
  bottom: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool_perm0"
  top: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool_nchw"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool_nchw"
  top: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/MaxPool_3a_3x3/MaxPool"
  top: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D_nchw"
  convolution_param {
    num_output: 80
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Conv2D"
  top: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Conv2d_3b_1x1/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_3b_1x1/Relu"
  top: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D_nchw"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Conv2D"
  top: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Conv2d_4a_3x3/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Conv2d_4a_3x3/Relu"
  top: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool_nchw"
  type: "Pooling"
  bottom: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool_perm0"
  top: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool_nchw"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool_nchw"
  top: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0a_1x1/Relu"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0b_3x3/Relu"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_nchw"
  convolution_param {
    num_output: 48
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0a_1x1/Relu"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/MaxPool_5a_3x3/MaxPool"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool_nchw"
  type: "Pooling"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/AvgPool_0a_3x3/AvgPool"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5b/concat"
  type: "Concat"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_0/Conv2d_0a_1x1/Relu"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_1/Conv2d_0b_5x5/Relu"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_2/Conv2d_0c_3x3/Relu"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/Branch_3/Conv2d_0b_1x1/Relu"
  top: "InceptionV3/InceptionV3/Mixed_5b/concat"
  concat_param {
    axis: 3
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/concat"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0a_1x1/Relu"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0b_3x3/Relu"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_2/Conv2d_0c_3x3/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/concat"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D_nchw"
  convolution_param {
    num_output: 48
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv2d_0b_1x1/Relu"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Conv2D"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_nchw"
  type: "BatchNorm"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_nchw"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_scale"
  type: "Scale"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_nchw"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm_scale"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Relu"
  type: "ReLU"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/BatchNorm/batchnorm"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_1/Conv_1_0c_5x5/Relu"
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/Conv2D_perm0"
  type: "Permute"
  bottom: "InceptionV3/InceptionV3/Mixed_5b/concat"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/Conv2D_perm0"
  top: "InceptionV3/InceptionV3/Mixed_5c/Branch_0/Conv2d_0a_1x1/Conv2D_nchw"
