name: "TensorFlowToCaffe"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.0078431368
    mean_value: 127.5 
    mean_value: 127.5
    mean_value: 127.5
    mirror: true
    crop_size: 299
  }
  data_param {
    source: "imagenet_rgb/ilsvrc12_train_lmdb"
    batch_size: 8
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.0078431368
    mean_value: 127.5 
    mean_value: 127.5
    mean_value: 127.5
    mirror: false
    crop_size: 299
  }
  data_param {
    source: "imagenet_rgb/ilsvrc12_val_lmdb"
    batch_size: 20
    backend: LMDB
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_1a_3x3__Conv2D"
  type: "Convolution"
  bottom: "data"
  top: "InceptionV3__InceptionV3__Conv2d_1a_3x3__Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Conv2d_1a_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_1a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Conv2d_1a_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_2a_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Conv2d_1a_3x3__Relu"
  top: "InceptionV3__InceptionV3__Conv2d_2a_3x3__Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Conv2d_2a_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_2a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Conv2d_2a_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_2b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Conv2d_2a_3x3__Relu"
  top: "InceptionV3__InceptionV3__Conv2d_2b_3x3__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Conv2d_2b_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_2b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Conv2d_2b_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__MaxPool_3a_3x3__MaxPool"
  type: "Pooling"
  bottom: "InceptionV3__InceptionV3__Conv2d_2b_3x3__Relu"
  top: "InceptionV3__InceptionV3__MaxPool_3a_3x3__MaxPool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
    ceil_mode: false
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_3b_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__MaxPool_3a_3x3__MaxPool"
  top: "InceptionV3__InceptionV3__Conv2d_3b_1x1__Conv2D"
  convolution_param {
    num_output: 80
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_3b_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Conv2d_3b_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Conv2d_3b_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_3b_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Conv2d_3b_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Conv2d_3b_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_3b_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Conv2d_3b_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Conv2d_3b_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_4a_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Conv2d_3b_1x1__Relu"
  top: "InceptionV3__InceptionV3__Conv2d_4a_3x3__Conv2D"
  convolution_param {
    num_output: 192
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_4a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Conv2d_4a_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Conv2d_4a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_4a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Conv2d_4a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Conv2d_4a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Conv2d_4a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Conv2d_4a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Conv2d_4a_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__MaxPool_5a_3x3__MaxPool"
  type: "Pooling"
  bottom: "InceptionV3__InceptionV3__Conv2d_4a_3x3__Relu"
  top: "InceptionV3__InceptionV3__MaxPool_5a_3x3__MaxPool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
    ceil_mode: false
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__MaxPool_5a_3x3__MaxPool"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__MaxPool_5a_3x3__MaxPool"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 48
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__MaxPool_5a_3x3__MaxPool"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__AvgPool_0a_3x3__AvgPool"
  type: "Pooling"
  bottom: "InceptionV3__InceptionV3__MaxPool_5a_3x3__MaxPool"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__AvgPool_0a_3x3__AvgPool"
  pooling_param {
    pool: AVE_TF
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_h: 1
    pad_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__AvgPool_0a_3x3__AvgPool"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0a_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0a_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0b_3x3__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5b__concat"
  type: "Concat"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_0__Conv2d_0a_1x1__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_1__Conv2d_0b_5x5__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_2__Conv2d_0c_3x3__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__Branch_3__Conv2d_0b_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5b__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__concat"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__concat"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__Conv2D"
  convolution_param {
    num_output: 48
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__concat"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__AvgPool_0a_3x3__AvgPool"
  type: "Pooling"
  bottom: "InceptionV3__InceptionV3__Mixed_5b__concat"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__AvgPool_0a_3x3__AvgPool"
  pooling_param {
    pool: AVE_TF
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_h: 1
    pad_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__AvgPool_0a_3x3__AvgPool"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv2d_0b_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0a_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0b_3x3__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5c__concat"
  type: "Concat"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_0__Conv2d_0a_1x1__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_1__Conv_1_0c_5x5__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_2__Conv2d_0c_3x3__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__Branch_3__Conv2d_0b_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5c__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__concat"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__concat"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 48
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__concat"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__AvgPool_0a_3x3__AvgPool"
  type: "Pooling"
  bottom: "InceptionV3__InceptionV3__Mixed_5c__concat"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__AvgPool_0a_3x3__AvgPool"
  pooling_param {
    pool: AVE_TF
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_h: 1
    pad_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__AvgPool_0a_3x3__AvgPool"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0a_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0a_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0b_3x3__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_5d__concat"
  type: "Concat"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_0__Conv2d_0a_1x1__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_1__Conv2d_0b_5x5__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_2__Conv2d_0c_3x3__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__Branch_3__Conv2d_0b_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_5d__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__concat"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__Conv2D"
  convolution_param {
    num_output: 384
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__concat"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_2__MaxPool_1a_3x3__MaxPool"
  type: "Pooling"
  bottom: "InceptionV3__InceptionV3__Mixed_5d__concat"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_2__MaxPool_1a_3x3__MaxPool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
    ceil_mode: false
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0a_1x1__Relu"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_0b_3x3__Relu"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__Relu"
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6a__concat"
  type: "Concat"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_0__Conv2d_1a_1x1__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_1__Conv2d_1a_1x1__Relu"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__Branch_2__MaxPool_1a_3x3__MaxPool"
  top: "InceptionV3__InceptionV3__Mixed_6a__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6b__Branch_0__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__concat"
  top: "InceptionV3__InceptionV3__Mixed_6b__Branch_0__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 192
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6b__Branch_1__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__concat"
  top: "InceptionV3__InceptionV3__Mixed_6b__Branch_1__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6b__Branch_2__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__concat"
  top: "InceptionV3__InceptionV3__Mixed_6b__Branch_2__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6b__Branch_3__AvgPool_0a_3x3__AvgPool"
  type: "Pooling"
  bottom: "InceptionV3__InceptionV3__Mixed_6a__concat"
  top: "InceptionV3__InceptionV3__Mixed_6b__Branch_3__AvgPool_0a_3x3__AvgPool"
  pooling_param {
    pool: AVE_TF
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_h: 1
    pad_w: 1
    pad_type: 1
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_6b__Branch_0__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV3__InceptionV3__Mixed_6b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV3__InceptionV3__Mixed_6b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV3__InceptionV3__Mixed_6b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV3__InceptionV3__Mixed_6b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV3__InceptionV3__Mixed_6b__Branch_1__Conv2d_0a_1x1__Conv2D"
