name: "TensorFlowToSynopsysCaffe"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 299
input_dim: 299
layer {
  name: "InceptionV4__InceptionV4__Conv2d_1a_3x3__Conv2D"
  type: "Convolution"
  bottom: "data"
  top: "InceptionV4__InceptionV4__Conv2d_1a_3x3__Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Conv2d_1a_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_1a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Conv2d_1a_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_2a_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Conv2d_1a_3x3__Relu"
  top: "InceptionV4__InceptionV4__Conv2d_2a_3x3__Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Conv2d_2a_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_2a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Conv2d_2a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Conv2d_2a_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_2b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Conv2d_2a_3x3__Relu"
  top: "InceptionV4__InceptionV4__Conv2d_2b_3x3__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Conv2d_2b_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Conv2d_2b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Conv2d_2b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Conv2d_2b_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_3a__Branch_0__MaxPool_0a_3x3__MaxPool"
  type: "Pooling"
  bottom: "InceptionV4__InceptionV4__Conv2d_2b_3x3__Relu"
  top: "InceptionV4__InceptionV4__Mixed_3a__Branch_0__MaxPool_0a_3x3__MaxPool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Conv2d_2b_3x3__Relu"
  top: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_3a__concat"
  type: "Concat"
  bottom: "InceptionV4__InceptionV4__Mixed_3a__Branch_0__MaxPool_0a_3x3__MaxPool"
  bottom: "InceptionV4__InceptionV4__Mixed_3a__Branch_1__Conv2d_0a_3x3__Relu"
  top: "InceptionV4__InceptionV4__Mixed_3a__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_3a__concat"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_3a__concat"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_0a_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0a_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 7
    stride_h: 1
    stride_w: 1
    pad_l: 3
    pad_r: 3
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0b_1x7__Relu"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 7
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 3
    pad_b: 3
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_0c_7x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_4a__concat"
  type: "Concat"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_0__Conv2d_1a_3x3__Relu"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__Branch_1__Conv2d_1a_3x3__Relu"
  top: "InceptionV4__InceptionV4__Mixed_4a__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__concat"
  top: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__Conv2D"
  convolution_param {
    num_output: 192
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5a__Branch_1__MaxPool_1a_3x3__MaxPool"
  type: "Pooling"
  bottom: "InceptionV4__InceptionV4__Mixed_4a__concat"
  top: "InceptionV4__InceptionV4__Mixed_5a__Branch_1__MaxPool_1a_3x3__MaxPool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5a__concat"
  type: "Concat"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__Branch_0__Conv2d_1a_3x3__Relu"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__Branch_1__MaxPool_1a_3x3__MaxPool"
  top: "InceptionV4__InceptionV4__Mixed_5a__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__concat"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__concat"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__concat"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__AvgPool_0a_3x3__AvgPool"
  type: "Pooling"
  bottom: "InceptionV4__InceptionV4__Mixed_5a__concat"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__AvgPool_0a_3x3__AvgPool"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__AvgPool_0a_3x3__AvgPool"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0a_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0a_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0b_3x3__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5b__concat"
  type: "Concat"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_0__Conv2d_0a_1x1__Relu"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_1__Conv2d_0b_3x3__Relu"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_2__Conv2d_0c_3x3__Relu"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__Branch_3__Conv2d_0b_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5b__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__concat"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__concat"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__concat"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__AvgPool_0a_3x3__AvgPool"
  type: "Pooling"
  bottom: "InceptionV4__InceptionV4__Mixed_5b__concat"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__AvgPool_0a_3x3__AvgPool"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__AvgPool_0a_3x3__AvgPool"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0a_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0a_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0b_3x3__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5c__concat"
  type: "Concat"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_0__Conv2d_0a_1x1__Relu"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_1__Conv2d_0b_3x3__Relu"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_2__Conv2d_0c_3x3__Relu"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__Branch_3__Conv2d_0b_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5c__concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__concat"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__concat"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__concat"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__AvgPool_0a_3x3__AvgPool"
  type: "Pooling"
  bottom: "InceptionV4__InceptionV4__Mixed_5c__concat"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__AvgPool_0a_3x3__AvgPool"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__AvgPool_0a_3x3__AvgPool"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_0__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0a_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0a_1x1__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_3__Conv2d_0b_1x1__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_1__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__Relu"
  type: "ReLU"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__BatchNorm__FusedBatchNorm__scale"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__Relu"
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0c_3x3__Conv2D"
  type: "Convolution"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0b_3x3__Relu"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0c_3x3__Conv2D"
  convolution_param {
    num_output: 96
    bias_term: false
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0c_3x3__Conv2D"
  top: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionV4__InceptionV4__Mixed_5d__Branch_2__Conv2d_0c_3x3__BatchNorm__FusedBatchNorm__scale"
  type: "Scale"
