name: "TensorFlowToCaffe"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 299
input_dim: 299
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3"
  type: "Convolution"
  bottom: "data"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_1a_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_2a_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_MaxPool_3a_3x3_MaxPool"
  type: "Pooling"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_2b_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_MaxPool_3a_3x3_MaxPool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_MaxPool_3a_3x3_MaxPool"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1"
  convolution_param {
    num_output: 80
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_3b_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_MaxPool_5a_3x3_MaxPool"
  type: "Pooling"
  bottom: "InceptionResnetV2_InceptionResnetV2_Conv2d_4a_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_MaxPool_5a_3x3_MaxPool"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_MaxPool_5a_3x3_MaxPool"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_MaxPool_5a_3x3_MaxPool"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1"
  convolution_param {
    num_output: 48
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0a_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 2
    pad_w: 2
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_MaxPool_5a_3x3_MaxPool"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0a_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0b_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_AvgPool_0a_3x3_AvgPool"
  type: "Pooling"
  bottom: "InceptionResnetV2_InceptionResnetV2_MaxPool_5a_3x3_MaxPool"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_AvgPool_0a_3x3_AvgPool"
  pooling_param {
    pool: AVE_TF
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    pad_h: 1
    pad_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_AvgPool_0a_3x3_AvgPool"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_concat"
  type: "Concat"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_0_Conv2d_1x1_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_1_Conv2d_0b_5x5_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_2_Conv2d_0c_3x3_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_Branch_3_Conv2d_0b_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_concat"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_concat"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_concat"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3"
  convolution_param {
    num_output: 48
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_concat"
  type: "Concat"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_0_Conv2d_1x1_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Conv2d_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_concat"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Conv2d_1x1"
  convolution_param {
    num_output: 320
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1"
  type: "Eltwise"
  bottom: "InceptionResnetV2_InceptionResnetV2_Mixed_5b_concat"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_Conv2d_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 0.170000001788
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3"
  convolution_param {
    num_output: 48
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_concat"
  type: "Concat"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_0_Conv2d_1x1_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Conv2d_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_concat"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Conv2d_1x1"
  convolution_param {
    num_output: 320
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2"
  type: "Eltwise"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_1_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_Conv2d_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 0.170000001788
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3"
  convolution_param {
    num_output: 48
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_concat"
  type: "Concat"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_0_Conv2d_1x1_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Conv2d_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_concat"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Conv2d_1x1"
  convolution_param {
    num_output: 320
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3"
  type: "Eltwise"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_2_r"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_Conv2d_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 0.170000001788
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1_bn"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1_scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1_r"
  type: "ReLU"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1_scale"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_0_Conv2d_1x1_r"
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_1_Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_3_r"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_1_Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_bn"
  type: "BatchNorm"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_1_Conv2d_0a_1x1"
  top: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_bn"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000475
  }
}
layer {
  name: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_scale"
  type: "Scale"
  bottom: "InceptionResnetV2_InceptionResnetV2_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_bn"
