layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
      dim: 1
      dim: 224
      dim: 224
      dim: 3
    }
  }
}
layer {
  name: "MobilenetV3/Conv/Conv2D_perm0"
  type: "Permute"
  bottom: "input"
  top: "MobilenetV3/Conv/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/Conv/Conv2D_perm0"
  top: "MobilenetV3/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 1
    pad_t: 0
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/Conv/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/Conv/Conv2D_nchw"
  top: "MobilenetV3/Conv/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/Conv/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/Conv/Conv2D"
  top: "MobilenetV3/Conv/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/Conv/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/Conv/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/Conv/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv/depthwise/depthwise_perm0"
  type: "Permute"
  bottom: "MobilenetV3/Conv/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv/depthwise/depthwise_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv/depthwise/depthwise_perm0"
  top: "MobilenetV3/expanded_conv/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 16
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 1
    pad_t: 0
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/depthwise/depthwise"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv/depthwise/depthwise"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv/depthwise/depthwise"
  top: "MobilenetV3/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/depthwise/Relu"
  top: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool_perm0"
  top: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 56
    kernel_w: 56
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/AvgPool"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 8
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv/BiasAdd"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv/BiasAdd"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv/BiasAdd"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/add"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/add"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/add"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv/depthwise/Relu"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv/project/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv/project/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv/project/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv/project/Conv2D_nchw"
  convolution_param {
    num_output: 16
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv/project/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv/project/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/project/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv/project/Conv2D"
  top: "MobilenetV3/expanded_conv/project/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/expand/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv/project/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_1/expand/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_1/expand/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_1/expand/Conv2D_nchw"
  convolution_param {
    num_output: 72
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/expand/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_1/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_1/expand/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_1/expand/Conv2D"
  top: "MobilenetV3/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/expand/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_1/expand/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_1/depthwise/depthwise_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_1/expand/Relu"
  top: "MobilenetV3/expanded_conv_1/depthwise/depthwise_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_1/depthwise/depthwise_perm0"
  top: "MobilenetV3/expanded_conv_1/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 72
    bias_term: false
    group: 72
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 1
    pad_t: 0
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/depthwise/depthwise"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_1/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_1/depthwise/depthwise"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_1/depthwise/depthwise"
  top: "MobilenetV3/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_1/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_1/project/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_1/depthwise/Relu"
  top: "MobilenetV3/expanded_conv_1/project/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_1/project/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_1/project/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/project/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_1/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_1/project/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/project/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_1/project/Conv2D"
  top: "MobilenetV3/expanded_conv_1/project/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/expand/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_1/project/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_2/expand/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_2/expand/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_2/expand/Conv2D_nchw"
  convolution_param {
    num_output: 88
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/expand/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_2/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_2/expand/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_2/expand/Conv2D"
  top: "MobilenetV3/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/expand/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_2/expand/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_2/expand/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_2/depthwise/depthwise_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_2/expand/Relu"
  top: "MobilenetV3/expanded_conv_2/depthwise/depthwise_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_2/depthwise/depthwise_perm0"
  top: "MobilenetV3/expanded_conv_2/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 88
    bias_term: false
    group: 88
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/depthwise/depthwise"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_2/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_2/depthwise/depthwise"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_2/depthwise/depthwise"
  top: "MobilenetV3/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_2/depthwise/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_2/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_2/project/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_2/depthwise/Relu"
  top: "MobilenetV3/expanded_conv_2/project/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_2/project/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_2/project/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/project/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_2/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_2/project/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/project/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_2/project/Conv2D"
  top: "MobilenetV3/expanded_conv_2/project/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_2/project/BatchNorm/FusedBatchNormV3"
  bottom: "MobilenetV3/expanded_conv_1/project/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_2/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/expand/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_2/add"
  top: "MobilenetV3/expanded_conv_3/expand/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/expand/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_3/expand/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/expand/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_3/expand/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_3/expand/Conv2D"
  top: "MobilenetV3/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_3/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_3/depthwise/depthwise_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_3/depthwise/depthwise_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/depthwise_perm0"
  top: "MobilenetV3/expanded_conv_3/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 96
    kernel_h: 5
    kernel_w: 5
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 2
    pad_t: 1
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/depthwise/depthwise"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_3/depthwise/depthwise"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/depthwise"
  top: "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_3/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_perm0"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 14
    kernel_w: 14
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/BiasAdd"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/BiasAdd"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/BiasAdd"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/add"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/add"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/add"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/hard_swish/mul_1"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_3/project/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_3/project/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/project/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_3/project/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/project/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_3/project/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/project/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_3/project/Conv2D"
  top: "MobilenetV3/expanded_conv_3/project/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/expand/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_3/project/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_4/expand/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/expand/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_4/expand/Conv2D_nchw"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/expand/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/expand/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_4/expand/Conv2D"
  top: "MobilenetV3/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_4/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_4/depthwise/depthwise_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_4/depthwise/depthwise_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/depthwise_perm0"
  top: "MobilenetV3/expanded_conv_4/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 192
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/depthwise/depthwise"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_4/depthwise/depthwise"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/depthwise"
  top: "MobilenetV3/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_4/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_perm0"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 14
    kernel_w: 14
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 48
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/BiasAdd"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/BiasAdd"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/BiasAdd"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/add"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/add"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/add"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/hard_swish/mul_1"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_4/project/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_4/project/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/project/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_4/project/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/project/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/project/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/project/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_4/project/Conv2D"
  top: "MobilenetV3/expanded_conv_4/project/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_4/project/BatchNorm/FusedBatchNormV3"
  bottom: "MobilenetV3/expanded_conv_3/project/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_4/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/expand/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_4/add"
  top: "MobilenetV3/expanded_conv_5/expand/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/expand/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_5/expand/Conv2D_nchw"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/expand/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_5/expand/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/expand/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_5/expand/Conv2D"
  top: "MobilenetV3/expanded_conv_5/expand/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_5/expand/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_5/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_5/depthwise/depthwise_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_5/depthwise/depthwise_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/depthwise_perm0"
  top: "MobilenetV3/expanded_conv_5/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 192
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/depthwise/depthwise"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_5/depthwise/depthwise"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/depthwise/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/depthwise"
  top: "MobilenetV3/expanded_conv_5/depthwise/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_5/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_perm0"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 14
    kernel_w: 14
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 48
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/BiasAdd"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/BiasAdd"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/BiasAdd"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/add"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/add"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/add"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/hard_swish/mul_1"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_5/project/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_5/project/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/project/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_5/project/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/project/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_5/project/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/project/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_5/project/Conv2D"
  top: "MobilenetV3/expanded_conv_5/project/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_5/project/BatchNorm/FusedBatchNormV3"
  bottom: "MobilenetV3/expanded_conv_4/add"
  top: "MobilenetV3/expanded_conv_5/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/expand/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_5/add"
  top: "MobilenetV3/expanded_conv_6/expand/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_6/expand/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_6/expand/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/expand/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_6/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_6/expand/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/expand/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_6/expand/Conv2D"
  top: "MobilenetV3/expanded_conv_6/expand/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_6/expand/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_6/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_6/depthwise/depthwise_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_6/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_6/depthwise/depthwise_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_6/depthwise/depthwise_perm0"
  top: "MobilenetV3/expanded_conv_6/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 96
    bias_term: false
    group: 96
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/depthwise/depthwise"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_6/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_6/depthwise/depthwise"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/depthwise/BatchNorm/FusedBatchNormV3"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_6/depthwise/depthwise"
  top: "MobilenetV3/expanded_conv_6/depthwise/BatchNorm/FusedBatchNormV3"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_6/depthwise/BatchNorm/FusedBatchNormV3"
  top: "MobilenetV3/expanded_conv_6/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_6/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool_perm0"
  top: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 14
    kernel_w: 14
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D_perm0"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_6/squeeze_excite/AvgPool"
  top: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D_perm0"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D_perm0"
  top: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: false
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D"
  type: "Permute"
  bottom: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/BiasAdd"
  type: "Bias"
  bottom: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Conv2D"
  top: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/BiasAdd"
  bias_param {
    axis: -1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/squeeze_excite/Conv/Relu"
  type: "ReLU"
