layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 224
      dim: 224
    }
  }
}
layer {
  name: "MobilenetV3/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "input"
  top: "MobilenetV3/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 1
    pad_t: 0
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/Conv/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/Conv/Conv2D_nchw"
  top: "MobilenetV3/Conv/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/Conv/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 16
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv/depthwise/Relu"
  top: "MobilenetV3/expanded_conv/project/Conv2D_nchw"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv/project/Conv2D_nchw"
  bottom: "MobilenetV3/Conv/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv/add"
  top: "MobilenetV3/expanded_conv_1/expand/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/expand/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_1/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_1/expand/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_1/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_1/expand/Relu"
  top: "MobilenetV3/expanded_conv_1/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 64
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 1
    pad_t: 0
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_1/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_1/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_1/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_1/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_1/depthwise/Relu"
  top: "MobilenetV3/expanded_conv_1/project/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_1/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_2/expand/Conv2D_nchw"
  convolution_param {
    num_output: 72
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/expand/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_2/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_2/expand/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_2/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_2/expand/Relu"
  top: "MobilenetV3/expanded_conv_2/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 72
    bias_term: true
    group: 72
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_2/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_2/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_2/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_2/depthwise/Relu"
  top: "MobilenetV3/expanded_conv_2/project/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_2/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_2/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_1/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_2/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_2/add"
  top: "MobilenetV3/expanded_conv_3/expand/Conv2D_nchw"
  convolution_param {
    num_output: 72
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/expand/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_3/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_3/expand/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_3/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/expand/Relu"
  top: "MobilenetV3/expanded_conv_3/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 72
    bias_term: true
    group: 72
    kernel_h: 5
    kernel_w: 5
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 2
    pad_t: 1
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_3/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/Relu"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 28
    kernel_w: 28
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 72
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_3/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_3/depthwise/Relu"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_3/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_3/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_3/project/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_3/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/expand/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/expand/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_4/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/expand/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_4/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/expand/Relu"
  top: "MobilenetV3/expanded_conv_4/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_4/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/Relu"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 28
    kernel_w: 28
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_4/depthwise/Relu"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_4/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_4/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_4/project/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_4/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_4/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_3/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_4/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_4/add"
  top: "MobilenetV3/expanded_conv_5/expand/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/expand/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_5/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_5/expand/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_5/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/expand/Relu"
  top: "MobilenetV3/expanded_conv_5/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 96
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/depthwise/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_5/depthwise/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/Relu"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 28
    kernel_w: 28
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 24
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_5/depthwise/Relu"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_5/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_5/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_5/project/Conv2D_nchw"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_5/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_5/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_4/add"
  top: "MobilenetV3/expanded_conv_5/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_5/add"
  top: "MobilenetV3/expanded_conv_6/expand/Conv2D_nchw"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_6/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_6/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_6/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_6/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_6/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 192
    bias_term: true
    group: 192
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 1
    pad_t: 0
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_6/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_6/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_6/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_6/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_6/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_6/project/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_7/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_6/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_7/expand/Conv2D_nchw"
  convolution_param {
    num_output: 160
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_7/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_7/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_7/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_7/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_7/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_7/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 160
    bias_term: true
    group: 160
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_7/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_7/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_7/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_7/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_7/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_7/project/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_7/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_7/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_6/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_7/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_8/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_7/add"
  top: "MobilenetV3/expanded_conv_8/expand/Conv2D_nchw"
  convolution_param {
    num_output: 144
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_8/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_8/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_8/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_8/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_8/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_8/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 144
    bias_term: true
    group: 144
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_8/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_8/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_8/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_8/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_8/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_8/project/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_8/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_8/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_7/add"
  top: "MobilenetV3/expanded_conv_8/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_9/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_8/add"
  top: "MobilenetV3/expanded_conv_9/expand/Conv2D_nchw"
  convolution_param {
    num_output: 144
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_9/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_9/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_9/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_9/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_9/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_9/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 144
    bias_term: true
    group: 144
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_9/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_9/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_9/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_9/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_9/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_9/project/Conv2D_nchw"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_9/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_9/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_8/add"
  top: "MobilenetV3/expanded_conv_9/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_10/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_9/add"
  top: "MobilenetV3/expanded_conv_10/expand/Conv2D_nchw"
  convolution_param {
    num_output: 384
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_10/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_10/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_10/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_10/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_10/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_10/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 384
    bias_term: true
    group: 384
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_10/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_10/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_10/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_10/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_10/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_10/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 14
    kernel_w: 14
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_10/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 96
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 384
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_10/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_10/depthwise/hard_swish/mul_1"
  bottom: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_10/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_10/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_10/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_10/project/Conv2D_nchw"
  convolution_param {
    num_output: 88
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_10/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_11/expand/Conv2D_nchw"
  convolution_param {
    num_output: 528
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_11/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_11/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_11/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_11/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_11/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 528
    bias_term: true
    group: 528
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 1
    pad_t: 1
    pad_b: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_11/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_11/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_11/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_11/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_11/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 14
    kernel_w: 14
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_11/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 136
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 528
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_11/depthwise/hard_swish/mul_1"
  bottom: "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_11/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_11/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_11/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_11/project/Conv2D_nchw"
  convolution_param {
    num_output: 88
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_11/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_11/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_10/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_11/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_12/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_11/add"
  top: "MobilenetV3/expanded_conv_12/expand/Conv2D_nchw"
  convolution_param {
    num_output: 528
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_12/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_12/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_12/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_12/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_12/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_12/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 528
    bias_term: true
    group: 528
    kernel_h: 5
    kernel_w: 5
    stride_h: 2
    stride_w: 2
    dilation: 1
    dilation: 1
    pad_l: 1
    pad_r: 2
    pad_t: 1
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_12/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_12/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_12/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_12/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_12/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_12/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 7
    kernel_w: 7
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_12/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 136
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 528
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_12/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_12/depthwise/hard_swish/mul_1"
  bottom: "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_12/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_12/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_12/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_12/project/Conv2D_nchw"
  convolution_param {
    num_output: 120
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_12/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_13/expand/Conv2D_nchw"
  convolution_param {
    num_output: 720
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_13/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_13/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_13/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_13/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_13/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 720
    bias_term: true
    group: 720
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_13/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_13/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_13/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_13/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_13/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 7
    kernel_w: 7
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_13/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 184
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 720
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_13/depthwise/hard_swish/mul_1"
  bottom: "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_13/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_13/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_13/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_13/project/Conv2D_nchw"
  convolution_param {
    num_output: 120
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_13/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_13/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_12/project/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_13/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/expand/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_13/add"
  top: "MobilenetV3/expanded_conv_14/expand/Conv2D_nchw"
  convolution_param {
    num_output: 720
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/expand/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_14/expand/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_14/expand/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_14/depthwise/depthwise_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_14/expand/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_14/depthwise/depthwise_nchw"
  convolution_param {
    num_output: 720
    bias_term: true
    group: 720
    kernel_h: 5
    kernel_w: 5
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 2
    pad_r: 2
    pad_t: 2
    pad_b: 2
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/depthwise/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/expanded_conv_14/depthwise/depthwise_nchw"
  top: "MobilenetV3/expanded_conv_14/depthwise/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/expanded_conv_14/squeeze_excite/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/expanded_conv_14/depthwise/hard_swish/mul_1"
  top: "MobilenetV3/expanded_conv_14/squeeze_excite/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 7
    kernel_w: 7
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_14/squeeze_excite/AvgPool_nchw"
  top: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv/Conv2D_nchw"
  convolution_param {
    num_output: 184
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv/Relu"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv/Relu"
}
layer {
  name: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv/Relu"
  top: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 720
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/Relu6"
  type: "ReLU"
  bottom: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/Relu6"
  relu_param {
    relu6: true
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/mul"
  type: "Scale"
  bottom: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/Relu6"
  top: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/mul"
  scale_param {
    axis: 1
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/squeeze_excite/mul"
  type: "Mul"
  bottom: "MobilenetV3/expanded_conv_14/depthwise/hard_swish/mul_1"
  bottom: "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/mul"
  top: "MobilenetV3/expanded_conv_14/squeeze_excite/mul"
}
layer {
  name: "MobilenetV3/expanded_conv_14/project/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_14/squeeze_excite/mul"
  top: "MobilenetV3/expanded_conv_14/project/Conv2D_nchw"
  convolution_param {
    num_output: 120
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/expanded_conv_14/add"
  type: "Eltwise"
  bottom: "MobilenetV3/expanded_conv_14/project/Conv2D_nchw"
  bottom: "MobilenetV3/expanded_conv_13/add"
  top: "MobilenetV3/expanded_conv_14/add"
  eltwise_param {
    operation: SUM
    coeff: 1.0
    coeff: 1.0
  }
}
layer {
  name: "MobilenetV3/Conv_1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/expanded_conv_14/add"
  top: "MobilenetV3/Conv_1/Conv2D_nchw"
  convolution_param {
    num_output: 720
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/Conv_1/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/Conv_1/Conv2D_nchw"
  top: "MobilenetV3/Conv_1/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/AvgPool2D/AvgPool_nchw"
  type: "Pooling"
  bottom: "MobilenetV3/Conv_1/hard_swish/mul_1"
  top: "MobilenetV3/AvgPool2D/AvgPool_nchw"
  pooling_param {
    pool: AVE_EXC_PAD
    kernel_h: 7
    kernel_w: 7
    stride_h: 1
    stride_w: 1
    ceil_mode: false
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/Conv_2/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/AvgPool2D/AvgPool_nchw"
  top: "MobilenetV3/Conv_2/Conv2D_nchw"
  convolution_param {
    num_output: 1280
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/Conv_2/hard_swish/mul_1"
  type: "HardSwish"
  bottom: "MobilenetV3/Conv_2/Conv2D_nchw"
  top: "MobilenetV3/Conv_2/hard_swish/mul_1"
}
layer {
  name: "MobilenetV3/Logits/Conv2d_1c_1x1/Conv2D_nchw"
  type: "Convolution"
  bottom: "MobilenetV3/Conv_2/hard_swish/mul_1"
  top: "MobilenetV3/Logits/Conv2d_1c_1x1/Conv2D_nchw"
  convolution_param {
    num_output: 1001
    bias_term: true
    group: 1
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
    dilation: 1
    pad_l: 0
    pad_r: 0
    pad_t: 0
    pad_b: 0
  }
}
layer {
  name: "MobilenetV3/Logits/Conv2d_1c_1x1/BiasAdd/MobilenetV3/Predictions/Reshape_perm"
  type: "Permute"
  bottom: "MobilenetV3/Logits/Conv2d_1c_1x1/Conv2D_nchw"
  top: "MobilenetV3/Logits/Conv2d_1c_1x1/BiasAdd/MobilenetV3/Predictions/Reshape_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "MobilenetV3/Predictions/Reshape"
  type: "Reshape"
  bottom: "MobilenetV3/Logits/Conv2d_1c_1x1/BiasAdd/MobilenetV3/Predictions/Reshape_perm"
  top: "MobilenetV3/Predictions/Reshape"
  reshape_param {
